gdb.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-15 Thu 01:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux - GNU Debugger (GDB)</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Linux - GNU Debugger (GDB)</h1>
<p>
<i>GDB</i> is the world famous GNU debugger, which is very powerful. In this article, its elementary usages can be listed as follows.
</p>
<ul class="org-ul">
<li><code>b(reak) LINE_IDX</code>: set breakpoint in line <code>LINE_IDX</code>.</li>
<li><code>b(reak) FUN_NAME</code>: set breakpoint at the begin of function <code>FUN_NAME</code>.</li>
<li><code>b(reak) ... if ...</code>: set conditional breakpoint.</li>
<li><code>delete breakpoints BP_IDX</code>: delete breakpoint <code>BP_IDX</code> (if <code>BP_IDX</code> is omitted, all the breakpoints will be deleted).</li>
<li><code>disable breakpoints BP_IDX</code>: disable breakpoint <code>BP_IDX</code> (if <code>BP_IDX</code> is omitted, all the breakpoints will be disabled).</li>
<li><code>enable breakpoints BP_IDX</code>: enable breakpoint <code>BP_IDX</code> (if <code>BP_IDX</code> is omitted, all the breakpoints will be enabled).</li>
<li><code>display VAR_NAME</code>: track varable <code>VAR_NAME</code>, every time the program stops, its value will be displayed.</li>
<li><code>undisplay VAR_NAME</code>: cancel tracking of variable <code>VAR_NAME</code>.</li>
<li><code>start</code>: start to excute the program and stop at the first statement of main.</li>
<li><code>r(un)</code>: excute the program from beginning continuously.</li>
<li><code>c(ontinue)</code>: excute the program from current position contiously.</li>
<li><code>s(tep)</code>: excute the program by one step and enter the function if available.</li>
<li><code>n(ext)</code>: excute the program by one step and don’t enter any function.</li>
<li><code>backtrace(or bt)</code>: view the function call of all the levels and their parameters.</li>
<li><code>f(rame) FRM_IDX</code>: select the stack frame of index <code>FRM_IDX</code>.</li>
<li><code>watch</code>: set observation point.</li>
<li><code>i(nfo) locals</code>: view the values of local variables in current stack frame.</li>
<li><code>i(nfo) b(reakpoints)</code>: view current breakpoints.</li>
<li><code>i(nfo) watchpoints</code>: view current observation points.</li>
<li><code>l(ist)</code>: list 10 lines of source code, continuing the last.</li>
<li><code>l(ist) LINE_IDX</code>: list the source code around line <code>LINE_IDX</code>.</li>
<li><code>l(ist) FUN_NAME</code>: list the source code of function <code>FUN_NAME</code>.</li>
<li><code>x</code>: print part content of register from some position. All the contents are treated as bytes without consideration that which bytes correspond to which variable. For example, <code>x/7b p</code> will print the content of size 7 bytes after point variable <code>p</code>.</li>
<li><code>p(rint) expr</code>: print the value of <code>expr</code>. This functionality can be used to change the values of variables or provoke a function.</li>
<li><code>finish</code>: excute the current function until return, and then stop.</li>
</ul>
</div>
</body>
</html>
